Repository: shusfun/cc-connect
Catalog: CodexMobile/CodexMobile/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Uncommitted changes also stay in this working copy and will follow onto the new branch after checkout.
zh_hans: 未提交修改也将保留在此工作副本中，切换后会带到新分支。

source: %@ (line %@)
zh_hans: %@（第 %@ 行）

source: %@ / %@ tokens
zh_hans: %@ / %@ Token

source: %@ armed
zh_hans: %@ 已启用

source: %@ failed
zh_hans: %@ 失败

source: %@ failed: %@
zh_hans: %@ 失败：%@

source: %@ files
zh_hans: %@ 个文件

source: %@ local changes from the current branch
zh_hans: 当前分支的 %@ 本地修改

source: %@ local commits
zh_hans: %@ 个本地提交

source: %@ modifier
zh_hans: %@ 修饰键

source: %@ percent used
zh_hans: 已使用百分之 %@

source: %@ previous messages
zh_hans: %@ 条较早消息

source: %@ risk
zh_hans: %@ 风险

source: %@ saved locally
zh_hans: %@ 已保存在本地

source: %@ state: %@
zh_hans: %@ 状态：%@

source: %@ stopped
zh_hans: %@ 已停止

source: %@ timed out while loading this chat.
zh_hans: %@ 加载此任务时超时。

source: %@ tool calls
zh_hans: %@ 次工具调用

source: %@%% left
zh_hans: 剩余 %@%%

source: %@: Unstage this file first to keep revert predictable.
zh_hans: %@：请先取消暂存，确保撤销范围可预测。

source: %@: also touched by another chat.
zh_hans: %@：其他任务也修改过此文件。

source: '%@' is already checked out in another worktree. Open that chat from the sidebar to continue there.
zh_hans: “%@”已在其他工作树中打开，请从侧栏打开对应任务继续。

source: '%@' is already checked out in another worktree. Open that chat to continue there.
zh_hans: “%@”已在其他工作树中打开，请打开对应任务继续。

source: (%@ used / %@)
zh_hans: （已使用 %@ / %@）

source: +%@ more files
zh_hans: 另有 %@ 个文件

source: 1 local commit
zh_hans: 1 个本地提交

source: 1 previous message
zh_hans: 1 条较早消息

source: 1 tool call
zh_hans: 1 次工具调用

source: A .git entry already exists in this folder.
zh_hans: 此文件夹已有 .git 条目。

source: A base branch is required to create the managed worktree.
zh_hans: 创建受管理的工作树需要选择基准分支。

source: A lightweight WebSocket server that routes messages between your iPhone and your device.
zh_hans: 在 iPhone 与设备之间转发消息的轻量 WebSocket 服务。

source: A new Remodex icon and unified visual identity, plus an SF Pro Rounded font option.
zh_hans: 全新 Remodex 图标和统一视觉设计，新增 SF Pro Rounded 字体选项。

source: A newer Remodex connection replaced this socket. Tap Reconnect to try again.
zh_hans: 新的 Remodex 连接已替换此连接，请点按“重新连接”。

source: A source thread id is required.
zh_hans: 缺少来源任务标识。

source: A thread payload was too large for the relay connection. This can happen while reopening image-heavy chats even if you didn't press Send.
zh_hans: 任务数据超出中继连接的大小限制。重新打开包含大量图片的任务时，即使未发送消息也可能出现此问题。

source: A valid device id is required.
zh_hans: 需要有效的设备标识。

source: A valid local project path is required.
zh_hans: 需要有效的本地项目路径。

source: A valid project path is required.
zh_hans: 需要有效的项目路径。

source: A worktree for '%@' already exists. Choose a different name.
zh_hans: “%@”的工作树已存在，请使用其他名称。

source: About Remodex
zh_hans: 关于 Remodex

source: About
zh_hans: 关于

source: Access %@
zh_hans: 访问权限：%@

source: Access the network
zh_hans: 访问网络

source: Access was revoked. Activate and pair the device again.
zh_hans: 授权已撤销，请重新激活并配对设备。

source: Access
zh_hans: 访问权限

source: Account-wide rate limits from your paired device.
zh_hans: 来自已配对设备的账号用量限制。

source: Action Needed
zh_hans: 需要操作

source: Active device, %@
zh_hans: 当前设备，%@

source: Active device
zh_hans: 当前设备

source: Active plan
zh_hans: 当前计划

source: Active
zh_hans: 活动中

source: Add Local Folder
zh_hans: 添加本地文件夹

source: Add a Git remote before creating a PR.
zh_hans: 创建 PR 前请先添加 Git 远程仓库。

source: Add a Git remote before using Commit & Push.
zh_hans: 使用“提交并推送”前请先添加 Git 远程仓库。

source: Add connection
zh_hans: 添加连接

source: Add that public key for the Windows user you will log in as
zh_hans: 将该公钥添加到要登录的 Windows 用户

source: Add
zh_hans: 添加

source: Added
zh_hans: 已添加

source: Advanced Configuration
zh_hans: 高级配置

source: After pairing, every message is wrapped in encrypted envelopes:
zh_hans: 配对后，每条消息均使用加密封装：

source: After the app finishes updating on your iPhone, reconnect to the device bridge.
zh_hans: iPhone 应用更新完成后，请重新连接设备 Bridge。

source: After the package finishes updating, restart the bridge on your device and come back here.
zh_hans: 设备应用更新完成后，请在设备上重新启动 Bridge，然后返回此处。

source: Agent %@
zh_hans: 代理 %@

source: Agent activity (%@)
zh_hans: 代理活动（%@）

source: Agent activity
zh_hans: 代理活动

source: Agent
zh_hans: 代理

source: All branches...
zh_hans: 所有分支…

source: All execution happens locally on your device — code generation, tool use, file edits. Nothing runs on the relay.
zh_hans: 代码生成、工具调用和文件编辑均在你的设备本地执行，中继不执行这些任务。

source: All plan tasks are done.
zh_hans: 计划中的所有任务均已完成。

source: Already undone
zh_hans: 已撤销

source: Also supports **workspace revert** — preview and apply reverse patches when the assistant makes changes you want to undo.
zh_hans: 还支持**工作区撤销**：当你想撤销助手的修改时，可以预览并应用反向补丁。

source: Always ask to edit external files and use the internet
zh_hans: 编辑外部文件或使用网络前始终询问

source: Answer ready in another chat
zh_hans: 另一个任务有答案待查看

source: Appearance
zh_hans: 外观

source: Apply file changes
zh_hans: 应用文件修改

source: Applying file changes...
zh_hans: 正在应用文件修改…

source: Approval denied
zh_hans: 审批已拒绝

source: Approval recorded; the retry will still be reviewed
zh_hans: 审批已记录；重试仍需审核

source: Approval request
zh_hans: 审批请求

source: Approval review stopped
zh_hans: 审批审核已停止

source: Approval review timed out
zh_hans: 审批审核已超时

source: Approval review updated
zh_hans: 审批审核已更新

source: Approve for Me
zh_hans: 代我审批

source: Approve for me is not supported by this Codex runtime. Update Codex on your Mac and retry.
zh_hans: 此 Codex 运行时不支持代为审批，请更新设备上的 Codex 后重试。

source: Approve for me requires a newer Codex version. Update Codex on your Mac and retry.
zh_hans: 代为审批需要更新版本的 Codex，请更新设备上的 Codex 后重试。

source: Approve for me
zh_hans: 代我审批

source: Approve one retry
zh_hans: 批准本次重试

source: Approve this retry in Codex Desktop.
zh_hans: 请在 Codex 桌面端批准本次重试。

source: Approve
zh_hans: 批准

source: Approved automatically
zh_hans: 已自动批准

source: Approved
zh_hans: 已批准

source: Architecture
zh_hans: 架构

source: Archive Project
zh_hans: 归档项目

source: Archive
zh_hans: 归档

source: Archived Chats
zh_hans: 已归档任务

source: Archived
zh_hans: 已归档

source: Arrow key controller
zh_hans: 方向键控制器

source: Ask Codex to continue...
zh_hans: 让 Codex 继续…

source: Ask Remodex
zh_hans: 询问 Remodex

source: Ask anything... @plugins, $skills, /commands
zh_hans: 输入你的问题… @插件、$技能、/命令

source: Ask for approval
zh_hans: 请求审批

source: Ask
zh_hans: 询问

source: Assistant Message
zh_hans: 助手消息

source: Authenticated
zh_hans: 已认证

source: Authentication
zh_hans: 身份认证

source: Authorization
zh_hans: 授权

source: Authorization: %@
zh_hans: 授权：%@

source: Auto
zh_hans: 自动

source: Auto-reconnect with exponential backoff (1s → 5s)
zh_hans: 断线自动重连，重试间隔逐步增加（1 秒至 5 秒）

source: Auto-review · %@
zh_hans: 自动审核 · %@

source: Auto-review, %@
zh_hans: 自动审核，%@

source: Automation
zh_hans: 自动化

source: Back to %@
zh_hans: 返回 %@

source: Back to work
zh_hans: 返回任务

source: Back
zh_hans: 返回

source: Backend
zh_hans: 后端

source: Base Branch
zh_hans: 基准分支

source: Base branch is required.
zh_hans: 请选择基准分支。

source: Base branch
zh_hans: 基准分支

source: Better Markdown
zh_hans: 更好的 Markdown 显示

source: Better Model Controls
zh_hans: 更完善的模型控制

source: Better Voice Input
zh_hans: 更好的语音输入

source: Binary changes are not auto-revertable in v1.
zh_hans: 当前版本不支持自动撤销二进制文件修改。

source: Binary files
zh_hans: 二进制文件

source: Block markdown
zh_hans: 块级 Markdown

source: Blocked
zh_hans: 已阻塞

source: Blue
zh_hans: 蓝色

source: Bounded outbound buffer re-sends missed encrypted messages
zh_hans: 使用有界发送缓冲区补发遗漏的加密消息

source: Branch Already Exists
zh_hans: 分支已存在

source: Branch Creation Failed
zh_hans: 创建分支失败

source: Branch Switch Failed
zh_hans: 切换分支失败

source: Branch already exists.
zh_hans: 分支已存在。

source: Branch already open elsewhere
zh_hans: 分支已在其他位置打开

source: Branch is behind remote. Pull first.
zh_hans: 分支落后于远程，请先拉取。

source: Branch name is not valid for Git.
zh_hans: 分支名称不符合 Git 规则。

source: Branch name is required.
zh_hans: 请输入分支名称。

source: Branch name
zh_hans: 分支名称

source: Branch not published yet
zh_hans: 分支尚未发布

source: Branch will be created locally and checked out. Uncommitted changes stay with this working copy.
zh_hans: 将在本地创建并切换分支，未提交修改保留在此工作副本中。

source: Branch
zh_hans: 分支

source: Branches
zh_hans: 分支

source: Bridge is managed by the desktop app. Use its connection and diagnostics pages; no global Remodex CLI is required.
zh_hans: Bridge 由桌面应用管理，请使用应用中的连接和诊断页面，无需安装全局 Remodex CLI。

source: Bridge persists your phone's identity locally
zh_hans: Bridge 在设备本地保存手机身份

# Bridge 不支持 Remodex 私有增量同步协议 v%@，请升级 Mac App。
source: Bridge does not support private sync protocol v%@. Update the desktop app.
zh_hans: Bridge 不支持 Remodex 私有增量同步协议 v%@，请升级 Mac App。

# Bridge 身份与当前已配对 Mac 不一致，请重新配对。
source: The Bridge identity does not match the paired device. Pair again.
zh_hans: Bridge 身份与当前已配对 Mac 不一致，请重新配对。

# Bridge 随 Remodex.app 一起更新，不需要安装全局 CLI。
source: Bridge is updated with Remodex.app. No global CLI installation is needed.
zh_hans: Bridge 随 Remodex.app 一起更新，不需要安装全局 CLI。

source: Bring local changes to '%@'?
zh_hans: 将本地修改带到“%@”？

source: Brown
zh_hans: 棕色

source: Browse or create a folder on your device.
zh_hans: 浏览或创建设备上的文件夹。

source: Bubble Row
zh_hans: 气泡行

source: Budget %@ tokens · %@ remaining
zh_hans: 预算 %@ Token · 剩余 %@

source: Budget Limited
zh_hans: 预算受限

source: Camera is not available on this device.
zh_hans: 此设备无法使用相机。

source: Cancel voice recording
zh_hans: 取消录音

source: Cancel
zh_hans: 取消

source: Cannot operate on the main branch.
zh_hans: 无法在主分支上执行此操作。

source: Cannot reach relay server at %@. Check that the iPhone can access the paired device on the local network.
zh_hans: 无法连接 %@ 的中继服务，请检查 iPhone 是否可通过本地网络访问设备。

source: Cannot remove the main local checkout.
zh_hans: 无法移除主本地工作副本。

source: Cannot resolve server host (%@). Check the relay URL.
zh_hans: 无法解析服务器主机（%@），请检查中继地址。

source: Cannot switch branches: this branch is already open in another worktree.
zh_hans: 无法切换：此分支已在其他工作树中打开。

source: Cannot switch branches: tracked local changes would be overwritten.
zh_hans: 无法切换：已跟踪的本地修改将被覆盖。

source: Cannot switch branches: untracked files would be overwritten.
zh_hans: 无法切换：未跟踪文件将被覆盖。

source: Cannot undo
zh_hans: 无法撤销

source: Carry to New Branch
zh_hans: 带到新分支

source: Changes how Codex requests permission
zh_hans: 设置 Codex 请求权限的方式

source: Changes unavailable
zh_hans: 无法获取修改

source: Changes
zh_hans: 修改

source: Chat Deleted
zh_hans: 任务已删除

source: Chat Runtime
zh_hans: 任务运行时

source: ChatGPT sign-in did not complete.
zh_hans: ChatGPT 登录未完成。

source: Chats are End-to-end encrypted
zh_hans: 任务消息采用端到端加密

source: Chats are end-to-end encrypted between your iPhone and paired device.
zh_hans: 任务消息在 iPhone 与已配对设备之间进行端到端加密。

source: Chats selected
zh_hans: 已选任务

source: Chats
zh_hans: 任务

source: Check that another app is not holding the microphone, then try again.
zh_hans: 请确认麦克风未被其他应用占用，然后重试。

source: Checked
zh_hans: 已检查

source: Checking whether the reverse patch applies cleanly...
zh_hans: 正在检查反向补丁能否无冲突应用…

source: Checking
zh_hans: 检查中

source: Child thread created
zh_hans: 子任务已创建

source: Choose a base branch before starting this review.
zh_hans: 开始审查前请选择基准分支。

source: Choose a review target first.
zh_hans: 请先选择审查目标。

source: Choose any base branch, carry configured project files into new worktrees, and keep worktree chats grouped under their original project.
zh_hans: 选择基准分支，将已配置的项目文件带入新工作树，并将工作树任务归入原项目。

source: Choose model
zh_hans: 选择模型

source: Choose the Mac
zh_hans: 选择设备

source: Choose what the reviewer should compare.
zh_hans: 选择审查时要比较的内容。

source: Cipher
zh_hans: 加密算法

source: Cleaner Mac bridge removal, fixed service restart loops, and many additional synchronization, performance, and stability improvements.
zh_hans: 改进设备 Bridge 清理流程，修复反复重启，并优化同步、性能与稳定性。

source: Cleaner Timelines
zh_hans: 更清晰的时间线

source: Clear Goal
zh_hans: 清除目标

source: Clear draft text, files, skills, and images first
zh_hans: 请先清除草稿文字、文件、技能和图片

source: Clear text, files, skills, and images before starting a code review.
zh_hans: 开始代码审查前，请清除文字、文件、技能和图片。

source: Clear this goal?
zh_hans: 清除此目标？

source: Clear
zh_hans: 清除

source: Clearer Tool Activity
zh_hans: 更清晰的工具活动

source: Close code review options
zh_hans: 关闭代码审查选项

source: Close failed
zh_hans: 关闭失败

source: Close fork options
zh_hans: 关闭分叉选项

source: Close interrupted
zh_hans: 关闭已中断

source: Close menu
zh_hans: 关闭菜单

source: Close other audio-heavy apps, then try voice mode again.
zh_hans: 请关闭其他大量使用音频的应用，再尝试语音模式。

source: Close
zh_hans: 关闭

source: Closed
zh_hans: 已关闭

source: Closing %@ %@
zh_hans: 正在关闭 %@ %@

source: Closing agent
zh_hans: 正在关闭代理

source: Closing
zh_hans: 正在关闭

source: Code Review
zh_hans: 代码审查

source: Code Review: %@
zh_hans: 代码审查：%@

source: Codex has prepared a plan for this chat.
zh_hans: Codex 已为此任务准备好计划。

source: Codex is requesting permission to continue.
zh_hans: Codex 正在请求继续操作的权限。

source: Codex keeps working toward this goal whenever the chat is idle, until it is complete, paused, or out of budget.
zh_hans: 任务空闲时，Codex 会继续推进此目标，直到完成、暂停或预算耗尽。

source: Codex needs %@ answers
zh_hans: Codex 需要 %@ 个回答

source: Codex needs one answer
zh_hans: Codex 需要一个回答

source: Codex process stays alive across transient drops
zh_hans: 短暂断线不会结束 Codex 进程

source: Codex stops pursuing the objective and forgets its goal progress accounting.
zh_hans: Codex 将停止推进此目标，并清除目标进度统计。

source: Codex stops pursuing the objective and forgets its progress accounting.
zh_hans: Codex 将停止推进此目标，并清除进度统计。

source: Collapse All
zh_hans: 全部收起

source: Collapse all
zh_hans: 全部收起

source: Collapse commands
zh_hans: 收起命令

source: Collapse file changes
zh_hans: 收起文件修改

source: Collapse plan
zh_hans: 收起计划

source: Collapse previous messages
zh_hans: 收起较早消息

source: Collapse project controls
zh_hans: 收起项目操作

source: Collapse review details
zh_hans: 收起审查详情

source: Collapse subagents
zh_hans: 收起子代理

source: Collapse
zh_hans: 收起

source: Collapses all project folders
zh_hans: 收起所有项目文件夹

source: Collapses goal details
zh_hans: 收起目标详情

source: Command copied
zh_hans: 命令已复制

source: Command
zh_hans: 命令

source: Command: %@
zh_hans: 命令：%@

source: Commands and tool calls are now grouped, expandable, and easier to follow with improved icons, statuses, history, and file changes.
zh_hans: 命令与工具调用现已分组展示并支持展开，图标、状态、历史和文件修改更清晰。

source: Commit & push complete
zh_hans: 提交并推送完成

source: Commit Failed
zh_hans: 提交失败

source: Commit local changes before creating a PR.
zh_hans: 创建 PR 前请先提交本地修改。

source: Commit message ready
zh_hans: 提交说明已就绪

source: Commit, push, pull, and switch branches
zh_hans: 提交、推送、拉取和切换分支

source: Commit
zh_hans: 提交

source: Committed
zh_hans: 已提交

source: Committing
zh_hans: 正在提交

source: Compact error: %@
zh_hans: 压缩错误：%@

source: Compact
zh_hans: 精简

source: Compacting context…
zh_hans: 正在压缩上下文…

source: Compared
zh_hans: 已比较

source: Comparing
zh_hans: 正在比较

source: Complete
zh_hans: 完成

source: Completed plan
zh_hans: 已完成的计划

source: Completed
zh_hans: 已完成

source: Composer Actions
zh_hans: 输入框操作

source: Composer Defaults
zh_hans: 输入默认设置

source: Composer Row
zh_hans: 输入栏

source: Composer options
zh_hans: 输入选项

source: Confirmation is required for this action.
zh_hans: 此操作需要确认。

source: Conflicts
zh_hans: 冲突

source: Connect and trust once
zh_hans: 连接并建立信任

source: Connect to Windows with SSH
zh_hans: 通过 SSH 连接 Windows

source: Connect to runtime first.
zh_hans: 请先连接运行时。

source: Connect to view conversations
zh_hans: 连接后查看任务

source: Connect
zh_hans: 连接

source: Connected Pair
zh_hans: 已连接的配对

source: Connected to Device
zh_hans: 已连接设备

source: Connected
zh_hans: 已连接

source: Connecting to relay…
zh_hans: 正在连接中继…

source: Connecting
zh_hans: 正在连接

source: Connection Resilience
zh_hans: 连接恢复能力

source: Connection already in progress
zh_hans: 连接正在进行中

source: Connection refused by relay server at %@.
zh_hans: %@ 的中继服务器拒绝连接。

source: Connection status: %@
zh_hans: 连接状态：%@

source: Connection timed out after 12s while opening the direct relay socket.
zh_hans: 打开直连中继连接时等待 12 秒后超时。

source: Connection timed out after 12s while opening the relay websocket.
zh_hans: 打开中继 WebSocket 时等待 12 秒后超时。

source: Connection timed out after 12s
zh_hans: 连接等待 12 秒后超时

source: Connection timed out while reconnecting. Try again.
zh_hans: 重连超时，请重试。

source: Connection timed out. Check server/network.
zh_hans: 连接超时，请检查服务器和网络。

source: Connection timed out. Retrying...
zh_hans: 连接超时，正在重试…

source: Connection was interrupted. Tap Reconnect to try again.
zh_hans: 连接已中断，请点按“重新连接”。

source: Connection
zh_hans: 连接

source: Connections
zh_hans: 连接

source: Context compacted
zh_hans: 上下文已压缩

source: Context window
zh_hans: 上下文窗口

source: Context
zh_hans: 上下文

source: Continue in a new local thread
zh_hans: 在新的本地任务中继续

source: Continue in a new worktree
zh_hans: 在新工作树中继续

source: Continue in
zh_hans: 继续于

source: Continue on Desktop App
zh_hans: 在桌面应用中继续

source: Continue
zh_hans: 继续

source: Control **Codex** from your iPhone.
zh_hans: 在 iPhone 上操作 **Codex**。

source: Control Codex from your iPhone.
zh_hans: 在 iPhone 上操作 Codex。

source: Conversation
zh_hans: 任务

source: Coordinating agents...
zh_hans: 正在协调代理…

source: Copied
zh_hans: 已复制

source: Copy a ready-made prompt and paste it into any AI.
zh_hans: 复制预设提示词，粘贴到 AI 中使用。

source: Copy bridge update command
zh_hans: 复制 Bridge 更新说明

source: Copy command
zh_hans: 复制命令

source: Copy path
zh_hans: 复制路径

source: Copy response
zh_hans: 复制回复

source: Copy sessionId
zh_hans: 复制会话标识

source: Copy setup prompt
zh_hans: 复制设置提示词

source: Copy
zh_hans: 复制

source: Copying
zh_hans: 正在复制

source: Could not continue this chat on the desktop app.
zh_hans: 无法在桌面应用中继续此任务。

source: Could not create branch.
zh_hans: 无法创建分支。

source: Could not create child thread
zh_hans: 无法创建子任务

source: Could not create worktree.
zh_hans: 无法创建工作树。

source: Could not determine a base branch for the new worktree chat.
zh_hans: 无法确定新工作树任务的基准分支。

source: Could not determine the repository default branch.
zh_hans: 无法确定仓库的默认分支。

source: Could not fork the thread into the new worktree.
zh_hans: 无法将任务分叉到新工作树。

source: Could not hand off the thread back to Local.
zh_hans: 无法将任务移回本地工作副本。

source: Could not hand off the thread to the new worktree.
zh_hans: 无法将任务移交到新工作树。

source: Could not hand off the thread to the target worktree.
zh_hans: 无法将任务移交到目标工作树。

source: Could not initialize Git in this folder.
zh_hans: 无法在此文件夹初始化 Git。

source: Could not load repository changes.
zh_hans: 无法加载仓库修改。

source: Could not move local changes into the handoff destination.
zh_hans: 无法将本地修改移到目标位置。

source: Could not reach the relay for this pairing code. Try again or scan the QR code.
zh_hans: 无法连接此配对码的中继，请重试或扫描二维码。

source: Could not reach the trusted device relay. Check your connection and try again.
zh_hans: 无法连接可信设备的中继，请检查网络后重试。

source: Could not reconnect to the selected device.
zh_hans: 无法重新连接所选设备。

source: Could not reconnect. Tap Reconnect to try again.
zh_hans: 重连失败，请点按“重新连接”重试。

source: Could not relaunch Codex.app on this device.
zh_hans: 无法重新启动设备上的 Codex.app。

source: Could not resolve the Local checkout for this worktree thread.
zh_hans: 无法定位此工作树任务的本地工作副本。

source: Could not resolve the local project path for this thread.
zh_hans: 无法确定此任务的本地项目路径。

source: Could not resolve the paired Local checkout for this worktree.
zh_hans: 无法定位此工作树对应的本地工作副本。

source: Could not resolve the target project path.
zh_hans: 无法确定目标项目路径。

source: Could not safely undo this response.
zh_hans: 无法安全撤销此回复的修改。

source: Could not switch branch.
zh_hans: 无法切换分支。

source: Could not wake this device's display right now.
zh_hans: 目前无法唤醒设备显示器。

source: Couldn't continue on desktop app
zh_hans: 无法在桌面应用中继续

source: Couldn't load earlier messages. Tap to retry.
zh_hans: 无法加载较早消息，点按重试。

source: Couldn't load this chat yet. Retrying in the background.
zh_hans: 暂时无法加载此任务，正在后台重试。

source: Couldn't retrieve this chat's history yet. Retrying in the background.
zh_hans: 暂时无法获取此任务的历史，正在后台重试。

source: Couldn't verify this chat's history yet. Retrying in the background.
zh_hans: 暂时无法核验此任务的历史，正在后台重试。

source: Create Anyway
zh_hans: 仍然创建

source: Create PR
zh_hans: 创建 PR

source: Create a Remodex key
zh_hans: 创建 Remodex 密钥

source: Create a key on the device that will connect
zh_hans: 在用于连接的设备上创建密钥

source: Create and check out a branch in a new worktree to continue in parallel. The branch is normalized with the remodex/ prefix.
zh_hans: 在新工作树中创建并切换分支，以便并行继续。分支统一使用 remodex/ 前缀。

source: Create and check out a branch in a new worktree, then fork this conversation into that checkout as a new chat.
zh_hans: 在新工作树中创建并切换分支，再将当前任务分叉为该工作副本中的新任务。

source: Create and checkout '%@'
zh_hans: 创建并切换到“%@”

source: Create long-running goals, track progress and token budgets, pause or resume work, and receive completion notifications.
zh_hans: 创建长期目标、跟踪进度与 Token 预算，并暂停或恢复任务。

source: Create this folder on your device and start a chat there.
zh_hans: 在设备上创建此文件夹，并在其中开始任务。

source: Create
zh_hans: 创建

source: Created
zh_hans: 已创建

source: Creating '%@' can %@ local changes only from the current branch. Switch the base branch to '%@' or clean up local changes before creating the worktree.
zh_hans: 创建“%@”时只能从当前分支%@本地修改，请将基准分支切换为“%@”或先处理本地修改。

source: Creating PR...
zh_hans: 正在创建 PR…

source: Creating a managed worktree can %@ local changes only from the current branch. Switch the base branch to '%@' or clean up local changes before creating the worktree.
zh_hans: 创建受管理工作树时只能从当前分支%@本地修改，请将基准分支切换为“%@”或先处理本地修改。

source: Creating fork...
zh_hans: 正在创建分叉…

source: Creating
zh_hans: 正在创建

source: Current Branch
zh_hans: 当前分支

source: Current Folder
zh_hans: 当前文件夹

source: Current branch unavailable
zh_hans: 无法获取当前分支

source: Current branch
zh_hans: 当前分支

source: Current
zh_hans: 当前

source: Custom
zh_hans: 自定义

source: Cyan
zh_hans: 青色

source: Decline
zh_hans: 拒绝

source: Default
zh_hans: 默认

source: Deleted
zh_hans: 已删除

source: Denied
zh_hans: 已拒绝

source: Deny
zh_hans: 拒绝

source: Describe the outcome, how to verify it, and what must not regress. Codex keeps working toward it across turns.
zh_hans: 描述期望结果、验证方式以及不能破坏的行为。Codex 会跨轮次持续推进。

source: Desktop App Integration
zh_hans: 桌面应用集成

source: Desktop app handoff works only when the bridge is running on a supported desktop platform.
zh_hans: 仅当 Bridge 运行在受支持的桌面平台上时，才能移交给桌面应用。

source: Detached worktree from the default branch.
zh_hans: 基于默认分支的分离工作树。

source: Device limit reached. Remove a device or contact the administrator.
zh_hans: 已达到设备上限，请移除设备或联系管理员。

source: Device name
zh_hans: 设备名称

source: Device offline. Open the desktop app and reconnect.
zh_hans: 设备离线，请打开桌面应用后重新连接。

source: Device
zh_hans: 设备

source: Devices
zh_hans: 设备

source: Diagnostic reference: %@
zh_hans: 诊断编号：%@

source: Diagram
zh_hans: 图表

source: Diff against %@
zh_hans: 与 %@ 比较差异

source: Directory
zh_hans: 目录

source: Disable Plan Mode
zh_hans: 关闭计划模式

source: Discard Changes
zh_hans: 放弃修改

source: Discard Failed
zh_hans: 放弃修改失败

source: Discard Local Changes
zh_hans: 放弃本地修改

source: Discard local changes?
zh_hans: 放弃本地修改？

source: Discarding changes...
zh_hans: 正在放弃修改…

source: Disconnect
zh_hans: 断开连接

source: Dismiss issue
zh_hans: 关闭问题提示

source: Dismiss keyboard
zh_hans: 收起键盘

source: Dismiss notification
zh_hans: 关闭通知

source: Dismiss search
zh_hans: 关闭搜索

source: Dismiss
zh_hans: 关闭

source: Display sleep does not interrupt Remodex. If macOS enters system sleep, remote access stays offline until the Mac wakes.
zh_hans: 显示器熄灭不会中断 Remodex；如果 macOS 进入系统睡眠，远程访问将离线，直到设备唤醒。

source: Documents
zh_hans: 文档

source: Done
zh_hans: 完成

source: Down
zh_hans: 向下

source: Draft
zh_hans: 草稿

source: Duplicate messages, reasoning, final answers, and stale tool activity have been reduced, with smoother scrolling and history restoration.
zh_hans: 减少重复消息、推理、最终回复和过期工具活动，改善滚动及历史恢复。

source: Duration
zh_hans: 持续时间

source: Edit %@ files: %@
zh_hans: 编辑 %@ 个文件：%@

source: Edit %@
zh_hans: 编辑 %@
